Arellano1904/Texas-Instruments-TivaC/EK-TM4C1294XL/Proyectos/2.4SPIDisplay/2.4SPIDisplay.c
       if(adc_ready){
            adc_ready = 0;
            volts = get_volts(adc_raw);
            ili9341_print_float(80, 32, volts, 2, BLUE, BLACK);
            pwm_set_from_adc();
        }       
    }
}

//*****************************************************************************
// Function definitions.
//*****************************************************************************
// BUTTONS //
void buttons_config(void){
    // Enable and wait on PORTJ enabling //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOJ));
    // Configure PJ0 and PJ1 as input //
    MAP_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    // Enable internal pull-ups //
    MAP_GPIOPadConfigSet(GPIO_PORTJ_BASE,GPIO_PIN_0 | GPIO_PIN_1,GPIO_STRENGTH_2MA,GPIO_PIN_TYPE_STD_WPU);
    // Disable interrupts during setup
    MAP_GPIOIntDisable(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    MAP_GPIOIntClear(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    // Configure interrupt type: falling edge
    MAP_GPIOIntTypeSet(GPIO_PORTJ_BASE,GPIO_PIN_0 | GPIO_PIN_1,GPIO_FALLING_EDGE);
    // Enable GPIO interrupt (NVIC)
    MAP_IntEnable(INT_GPIOJ);
    // Enable GPIO pin interrupts
    MAP_GPIOIntEnable(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);
}

void buttons_ints_handler(void){
    // Read interrupt status from port J.
    uint32_t status = MAP_GPIOIntStatus(GPIO_PORTJ_BASE, true);
    // Clear interrupts immediately
    MAP_GPIOIntClear(GPIO_PORTJ_BASE, status);
    if(status & GPIO_PIN_0){// SW1 pressed
        sw1State = 0x01;
        return;
    }

    if(status & GPIO_PIN_1){// SW2 pressed
        sw2State = 0x01;
        return;
    }
}
// LEDS //
void leds_config(void){
    // Enable and wait for PORTN and PORTF to be ready
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOF));
    // Configure PN0,PN1,PF0 and PF4 as output
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_0 | GPIO_PIN_4);
    // Turn LEDs off initially
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0 | GPIO_PIN_1, 0x00);
    MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0 | GPIO_PIN_4, 0x00);
}

// SPI1 for display //
void spi1_config(void){
    // Enabling and wait for QSSI module and ports B and E to be ready
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI1);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOE));
    // Configure pins for QSSI1 
    // {PB2:rst,PB3:DC,PB4:CS,PB5:spi1_clk,PE4:spi1_tx,PE5:spi1_rx}
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE,GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4);
    MAP_GPIOPinConfigure(GPIO_PB5_SSI1CLK);
    MAP_GPIOPinConfigure(GPIO_PE4_SSI1XDAT0);
    MAP_GPIOPinConfigure(GPIO_PE5_SSI1XDAT1);
    MAP_GPIOPinTypeSSI(GPIO_PORTB_BASE, GPIO_PIN_5);
    MAP_GPIOPinTypeSSI(GPIO_PORTE_BASE, GPIO_PIN_4 | GPIO_PIN_5);
    // Pin PB4 HIGH to dissable the display.
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_4, GPIO_PIN_4);
    // Config QSSI1 module, master mode, 16bits len.
    MAP_SSIDisable(SSI1_BASE);
    SSIClockSourceSet(SSI1_BASE, SSI_CLOCK_SYSTEM);
    MAP_SSIConfigSetExpClk(SSI1_BASE, sysClock, SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,50000000, 16);
    MAP_SSIEnable(SSI1_BASE);
}

void spi1_data_len(uint32_t len){
    MAP_SSIDisable(SSI1_BASE);
    MAP_SSIConfigSetExpClk(SSI1_BASE, sysClock, SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,50000000, len);
    MAP_SSIEnable(SSI1_BASE);
}

// uDMA //
void uDMA_spi1_config(void){
    // Enable uDMA peripheral
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_UDMA));
    // Enable uDMA controller
    MAP_uDMAEnable();
    // Set base address of control table
    MAP_uDMAControlBaseSet(uDMAControlTable);
    // Enable uDMA on SSI1 TX
    MAP_SSIDMAEnable(SSI1_BASE, SSI_DMA_TX);
    // Optional but safe
    MAP_uDMAChannelAssign(UDMA_CH25_SSI1TX);
    // Disable channel before configuration
    MAP_uDMAChannelDisable(UDMA_CH25_SSI1TX);
    // Configure channel
    MAP_uDMAChannelControlSet(UDMA_CH25_SSI1TX | UDMA_PRI_SELECT,
        UDMA_SIZE_16 |        // 16-bit data
        UDMA_SRC_INC_16 |     // increment source
        UDMA_DST_INC_NONE |   // SSI FIFO
        UDMA_ARB_8);          // burst of 8 words
    // Enable uDMA ints
}

void uDMA_spi1_send_buffer(uint16_t* dataBuffer, uint32_t bufferLen){
    // Disable channel before setup
    MAP_uDMAChannelDisable(UDMA_CH25_SSI1TX);
    // Configure transfer
    MAP_uDMAChannelTransferSet(
        UDMA_CH25_SSI1TX | UDMA_PRI_SELECT,
        UDMA_MODE_BASIC,
        dataBuffer,
        (void *)(SSI1_BASE + SSI_O_DR),
        bufferLen
    );
    // Start transfer
    MAP_uDMAChannelEnable(UDMA_CH25_SSI1TX);
}

// TIMER0 //
void timer0_config(void){
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_TIMER0));

    MAP_TimerDisable(TIMER0_BASE, TIMER_A);

    MAP_TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);

    // 120 MHz / 1000 = 120,000 ticks → 1 ms
    MAP_TimerLoadSet(TIMER0_BASE, TIMER_A, (120000 - 1));

    // Habilitar evento de disparo para ADC
    MAP_TimerControlTrigger(TIMER0_BASE, TIMER_A, true);

    MAP_TimerEnable(TIMER0_BASE, TIMER_A);
}

// ADC //
void adc0_config(void){
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOD));

    // PD7 como ADC
    MAP_GPIOPinTypeADC(GPIO_PORTD_BASE, GPIO_PIN_7);
    // Sequencer 3, trigger por TIMER
    MAP_ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_TIMER, 0);
    // Disable sequencer 3 during config
    ADCSequenceDisable(ADC0_BASE, 3);
    // Canal AIN4 (PD7)
    MAP_ADCSequenceStepConfigure(ADC0_BASE, 3, 0,ADC_CTL_CH4 | ADC_CTL_IE | ADC_CTL_END);
    // Usa VDDA (3.3 V)
    MAP_ADCReferenceSet(ADC0_BASE, ADC_REF_EXT_3V);

