Arellano1904/Texas-Instruments-TivaC/EK-TM4C1294XL/Proyectos/2.4SPIDisplay/2.4SPIDisplay.c
    MAP_ADCSequenceEnable(ADC0_BASE, 3);
    MAP_ADCIntEnable(ADC0_BASE, 3);
    MAP_IntEnable(INT_ADC0SS3);
}

// PWM //
void pwm_config(void){
    uint32_t pwmClock;
    uint32_t load;

    // 1) Habilitar periféricos
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);

    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0));
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOG));

    // 2) Configurar PG0 como PWM (M0PWM4)
    MAP_GPIOPinConfigure(GPIO_PG0_M0PWM4);
    MAP_GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_0);

    // 3) Reloj del PWM = SYSCLK / 64
    MAP_SysCtlPWMClockSet(SYSCTL_PWMDIV_64);
    pwmClock = sysClock / 64;

    // 4) Calcular periodo
    load = (pwmClock / PWM_FREQUENCY) - 1;

    // 5) Configurar generador 2
    MAP_PWMGenConfigure(PWM0_BASE, PWM_GEN_2,
                     PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);

    MAP_PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, load);

    // Duty inicial = 0%
    MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4, 0);

    // 6) Habilitar PWM
    MAP_PWMGenEnable(PWM0_BASE, PWM_GEN_2);
    MAP_PWMOutputState(PWM0_BASE, PWM_OUT_4_BIT, true);
}

void pwm_set_from_adc(void){
    uint32_t load;
    uint32_t pulse;
    float duty;

    if(adc_raw > 4095)
        adc_raw = 4095;

    // Obtener el periodo actual del PWM
    load = MAP_PWMGenPeriodGet(PWM0_BASE, PWM_GEN_2);

    // Escalar ADC (0–4095) → (0–LOAD)
    pulse = (adc_raw * load) / 4095;

    // Evitar 100% exacto (opcional, pero recomendable)
    if(pulse >= load)
        pulse = load - 1;

    MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4, pulse);
    // Duty normalizado (0.0 – 1.0)
    duty = (float)pulse / (float)load;
    ili9341_print_float(180, 32 , duty, 2, CYAN, BLACK);
}

void pwm_init(void){
    uint32_t load;

    // 1. Habilitar periféricos
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);

    while(!SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0));
    while(!SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOG));

    // 2. Configurar reloj del PWM (System clock / 64)
    SysCtlPWMClockSet(SYSCTL_PWMDIV_64);

    // 3. Configurar PG0 como M0PWM4
    GPIOPinConfigure(GPIO_PG0_M0PWM4);
    GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_0);

    // 4. Configurar generador PWM (Gen 2)
    PWMGenConfigure(PWM0_BASE, PWM_GEN_2,
                     PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);

    // 5. Calcular LOAD para 10 kHz
    load = (sysClock / 1 / 10000) - 1;

    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, load);

    // 6. Duty cycle 50%
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4, load / 2);

    // 7. Habilitar salida PWM
    PWMOutputState(PWM0_BASE, PWM_OUT_4_BIT, true);

    // 8. Arrancar el generador
    PWMGenEnable(PWM0_BASE, PWM_GEN_2);
}

void adc0_seq3_handler(void){
    MAP_ADCIntClear(ADC0_BASE, 3);
    MAP_ADCSequenceDataGet(ADC0_BASE, 3, &adc_raw);
    adc_ready = 0x01;
}
// DISPLAY //
void ili9341_reset(void){

    // PB2 to low for resete 
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0x00);
    MAP_SysCtlDelay((sysClock / 3000) * 5); // ~5ms
    // PB2 pin to high 
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);
    SysCtlDelay((sysClock / 3000) * 5); // ~5ms
}

void ili9341_send_command(uint8_t cmd){
    // PB4 and PB3 to low (Enable the Display and put it in command mode)
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_3 | GPIO_PIN_4, 0x00);
    // Send the command trough SPI1
    MAP_SSIDataPut(SSI1_BASE, cmd);
    // Wait for data to be tansfered
    while(MAP_SSIBusy(SSI1_BASE));
    // PB4 high to disabble the display
    MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4, GPIO_PIN_4);
}

void ili9341_send_data(uint8_t data){
    // PB4 low to enable the Display and PB3 high to data mode
    MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_3 | GPIO_PIN_4, 0x08);
    // Send the data to the SPI1
    MAP_SSIDataPut(SSI1_BASE, data);
    // Wait for data to be tansfered
    while(MAP_SSIBusy(SSI1_BASE));
    // PB4 high to disabble the display
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_4, GPIO_PIN_4);
}

void ili9341_init(void){ 
    uint16_t i; 
    ili9341_reset();
    // Change to 8bit len to send commands
    spi1_data_len(8);
    ili9341_send_command(0x01); // Software reset
    MAP_SysCtlDelay((sysClock / 3000) * 10);   // ~10ms
    ili9341_send_command(0x11); // Sleep out
    MAP_SysCtlDelay((sysClock / 3000) * 120);   // ~120ms
    ili9341_send_command(0x3A); // Pixel Format
    ili9341_send_data(0x55); // RGB565
    ili9341_send_command(0x36); // MADCTL
    ili9341_send_data(0x00); // RGB, 0 degrees rotation
    // ---- Power Control ----
    ili9341_send_command(0xC1); // Power Control 1
    ili9341_send_data(0x20);
    // ---- VCOM Control ----
    ili9341_send_command(0xC5);
    ili9341_send_data(0x3E);
    ili9341_send_data(0x28);

    ili9341_send_command(0xC7);
    ili9341_send_data(0x86);

    // ---- Frame Rate Control ----
    ili9341_send_command(0xB1);
    ili9341_send_data(0x00);
    ili9341_send_data(0x18);   // ~79Hz

    // ---- Gamma ----
    ili9341_send_command(0x26);
    ili9341_send_data(0x01);   // Gamma ON

    ili9341_send_command(0xE0); // Positive Gamma
    uint8_t pgamma[] = {
        0x0F,0x31,0x2B,0x0C,0x0E,0x08,
        0x4E,0xF1,0x37,0x07,0x10,0x03,
        0x0E,0x09,0x00
    };
    for(i=0;i<15;i++) ili9341_send_data(pgamma[i]);

    ili9341_send_command(0xE1); // Negative Gamma
    uint8_t ngamma[] = {
        0x00,0x0E,0x14,0x03,0x11,0x07,
        0x31,0xC1,0x48,0x08,0x0F,0x0C,
        0x31,0x36,0x0F
    };
    for(i=0;i<15;i++) ili9341_send_data(ngamma[i]);

    // ---- Interface Control (SPI estable) ----
    ili9341_send_command(0xF6);
    ili9341_send_data(0x01);
    ili9341_send_data(0x00);
    ili9341_send_data(0x00);

    ili9341_send_command(0xC1); // Power Control 2
    ili9341_send_data(0x10);
    ili9341_send_command(0x29);
    // Change to 16 bit len for send pixels data
    spi1_data_len(16); 
}

void ili9341_set_window(uint16_t x0, uint16_t y0,uint16_t x1, uint16_t y1){
    // Config spi3 to send command and data configuration
    spi1_data_len(8);
    // Column Address Set (CASET)
    ili9341_send_command(0x2A);
    ili9341_send_data(x0 >> 8);     // X start high
    ili9341_send_data(x0 & 0xFF);   // X start low
    ili9341_send_data(x1 >> 8);     // X end high
    ili9341_send_data(x1 & 0xFF);   // X end low

