Arellano1904/Texas-Instruments-TivaC/EK-TM4C1294XL/Proyectos/2.4SPIDisplay/2.4SPIDisplay.c
    // Page Address Set (PASET)
    ili9341_send_command(0x2B);
    ili9341_send_data(y0 >> 8);     // Y start high
    ili9341_send_data(y0 & 0xFF);   // Y start low
    ili9341_send_data(y1 >> 8);     // Y end high
    ili9341_send_data(y1 & 0xFF);   // Y end low

    // Write to RAM
    ili9341_send_command(0x2C);
    // Config spi3 to send pixels data
    spi1_data_len(16);
    
}

void ili9341_fill_screen(uint16_t color){
    uint32_t i;
    // Prepare one line
    for(i = 0; i < ILI9341_WIDTH * LINES_PER_BUFFER; i++)
        colorBuffer[i] = color;
    // Set full window
    ili9341_set_window(0, 0,ILI9341_WIDTH - 1,ILI9341_HEIGHT - 1);
    // PB4 low to enable the Display and PB3 high to data mode
    MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_3 | GPIO_PIN_4, 0x08); 
    // Stream lines using uDMA
    for(i = 0; i < ILI9341_HEIGHT;)
        if(!MAP_uDMAChannelSizeGet(UDMA_CH25_SSI1TX | UDMA_PRI_SELECT) && !SSIBusy(SSI1_BASE)){    
        uDMA_spi1_send_buffer(colorBuffer, ILI9341_WIDTH * LINES_PER_BUFFER);
        i+=LINES_PER_BUFFER;
        }
}

void ili9341_draw_char(uint16_t x, uint16_t y,char c,uint16_t fg, uint16_t bg){
    // Usefull variables to fill the buffer
    uint8_t row, col;
    uint8_t line;
    uint32_t idx = 0;

    if (c < 0x20 || c > 0x7F)
    c = '?';
    // 1. Preparar buffer del carácter
    for(row = 0; row < FONT_HEIGHT; row++)
    {
        line = font8x16[c - FONT_FIRST_CHAR][row];

        for(col = 0; col < FONT_WIDTH; col++)
        {
            if(line & (0x80 >> col))
                charBuffer[idx++] = fg;
            else
                charBuffer[idx++] = bg;
        }
    }
    // 2. Seleccionar ventana
    ili9341_set_window(x, y,x + FONT_WIDTH  - 1,y + FONT_HEIGHT - 1);
    // 3. PB4 low to enable the Display and PB3 high to data mode
    MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_3 | GPIO_PIN_4, 0x08);
    // 4. Enviar buffer por uDMA
    uDMA_spi1_send_buffer(charBuffer,FONT_WIDTH * FONT_HEIGHT);
}

void ili9341_print_string(uint16_t x, uint16_t y,const char *str,uint16_t fg,uint16_t bg){
    uint16_t cx = x;
    uint16_t cy = y;

    while(*str)
    {
        if(*str == '\n'){
            cx = x;
            cy += FONT_HEIGHT;
        }else{
            if(!MAP_uDMAChannelSizeGet(UDMA_CH25_SSI1TX | UDMA_PRI_SELECT) && !SSIBusy(SSI1_BASE)){  
                ili9341_draw_char(cx, cy, *str, fg, bg);
                cx += FONT_WIDTH;
                str++;
            }
        }
    }
} 

void ili9341_print_int(uint16_t x, uint16_t y,int32_t num,uint16_t color, uint16_t bg){
    char buf[12];
    intToStr(num, buf);
    ili9341_print_string(x,y,buf,color,bg);
}

void ili9341_print_float(uint16_t x, uint16_t y,float num, uint8_t decimals,uint16_t color, uint16_t bg){
    char buf[12];
    floatToStr(num, buf,decimals);
    ili9341_print_string(x,y,buf,color,bg);
}

// Funciones de apoyo
void intToStr(int32_t value, char *buf){
    char tmp[12];
    int i = 0, j = 0;

    if (value == 0)
    {
        buf[0] = '0';
        buf[1] = '\0';
        return;
    }

    if (value < 0)
    {
        buf[j++] = '-';
        value = -value;
    }

    while (value > 0)
    {
        tmp[i++] = (value % 10) + '0';
        value /= 10;
    }

    while (i > 0)
        buf[j++] = tmp[--i];

    buf[j] = '\0';
}

void floatToStr(float value, char *buf, uint8_t decimals){
    int32_t intPart;
    float frac;
    int i = 0,j = 0;

    if (value < 0)
    {
        buf[i++] = '-';
        value = -value;
    }

    intPart = (int32_t)value;
    frac = value - intPart;

    // Integer part
    char intBuf[12];
    intToStr(intPart, intBuf);

    for (j = 0; intBuf[j]; j++)
        buf[i++] = intBuf[j];

    buf[i++] = '.';

    // Fractional part
    while (decimals--)
    {
        frac *= 10.0f;
        int digit = (int)frac;
        buf[i++] = digit + '0';
        frac -= digit;
    }

    buf[i] = '\0';
}

float get_volts(uint32_t adc_value){
   return ((float)adc_value * 3.3f) / 4095.0f;
}
